src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonForms/ФормаВыбораСчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общая форма выбора счёта в стиле Wallet.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокФормы = "Выбор счёта";
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		
		ЗаголовокФормы = Параметры.Заголовок;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийСчет") Тогда
		
		ТекущийСчет = Параметры.ТекущийСчет;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключитьСчет") Тогда
		
		ИсключитьСчет = Параметры.ИсключитьСчет;
		
	КонецЕсли;
	
	Заголовок = ЗаголовокФормы;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомандаПриложения = "back" Или КомандаПриложения = "cancel" Тогда
		
		Закрыть(Неопределено);
		
	ИначеЕсли СтрНачинаетсяС(КомандаПриложения, "pick:") Тогда
		
		Идентификатор = Сред(КомандаПриложения, СтрДлина("pick:") + 1);
		Счет = СчетПоИдентификатору(Идентификатор);
		
		Если ЗначениеЗаполнено(Счет) Тогда
			
			Закрыть(Счет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ТекстHTML = СобратьHTMLВыбораСчета();
	
КонецПроцедуры

&НаСервере
Функция СобратьHTMLВыбораСчета()
	
	ТаблицаСчетов = ТаблицаСчетовСОстатками();
	Строки = Новый Массив;
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>" + СтилиВыбораСчета() + "</style></head><body>");
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ЗаголовокФормы) + "</div>");
	Строки.Добавить("<span class=""icon-btn ghost""></span></div>");
	Строки.Добавить("<div class=""list"">");
	
	Если ТаблицаСчетов.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Нет доступных счетов</div>");
		
	Иначе
		
		Индекс = 0;
		
		Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
			
			Если ЗначениеЗаполнено(ИсключитьСчет) И СтрокаСчета.Счет = ИсключитьСчет Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Выбран = СтрокаСчета.Счет = ТекущийСчет;
			Класс = ?(Выбран, "item selected", "item");
			Цвета = ЦветаИконкиСчета(СтрокаСчета.ВидСчета, Индекс);
			ОстатокТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(СтрокаСчета.Остаток, Ложь);
			Ссылка = "app:pick:" + Строка(СтрокаСчета.Счет.УникальныйИдентификатор());
			
			Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""ico"" style=""background:" + Цвета.Фон + ";color:" + Цвета.Цвет + """>"
				+ SVGИконкаСчета(СтрокаСчета.ВидСчета) + "</span>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаСчета.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(ПредставлениеВидаСчета(СтрокаСчета.ВидСчета))
				+ "</span></span>");
			Строки.Добавить("<span class=""right""><span class=""sum"">" + ОстатокТекст + "</span>");
			
			Если Выбран Тогда
				
				Строки.Добавить("<span class=""check"">✓</span>");
				
			Иначе
				
				Строки.Добавить("<span class=""chev"">›</span>");
				
			КонецЕсли;
			
			Строки.Добавить("</span></a>");
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

&НаСервере
Функция ТаблицаСчетовСОстатками()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кошелек.Ссылка КАК Счет,
	|	Кошелек.Наименование КАК Наименование,
	|	Кошелек.ВидСчета КАК ВидСчета,
	|	СУММА(ЕСТЬNULL(БалансОстатки.СуммаОстаток, 0)) КАК Остаток
	|ИЗ
	|	Справочник.Счета КАК Кошелек
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Баланс.Остатки(&Период, ) КАК БалансОстатки
	|		ПО БалансОстатки.Счета = Кошелек.Ссылка
	|ГДЕ
	|	НЕ Кошелек.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кошелек.Ссылка,
	|	Кошелек.Наименование,
	|	Кошелек.ВидСчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция СчетПоИдентификатору(ИдентификаторСтрокой)
	
	Возврат Справочники.Счета.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСтрокой));
	
КонецФункции

&НаСервере
Функция ПредставлениеВидаСчета(ВидСчета)
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		Возврат "Наличные";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		
		Возврат "Банковская карта";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		Возврат "Банковский счёт";
		
	КонецЕсли;
	
	Возврат "Счёт";
	
КонецФункции

&НаСервере
Функция ЦветаИконкиСчета(ВидСчета, Индекс)
	
	Результат = Новый Структура("Фон, Цвет", "#EFF6FF", "#2563EB");
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		Результат.Фон = "#ECFDF5";
		Результат.Цвет = "#16A34A";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		Результат.Фон = "#F0FDFA";
		Результат.Цвет = "#14B8A6";
		
	ИначеЕсли Индекс % 3 = 1 Тогда
		
		Результат.Фон = "#F5F3FF";
		Результат.Цвет = "#7C3AED";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтилиВыбораСчета()
	
	Возврат "*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}"
		+ "body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;background:#FAFAFA;color:#111827;padding:12px 16px 24px;line-height:1.3}"
		+ "a{text-decoration:none;color:inherit;display:block}"
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}"
		+ ".title{font-size:18px;font-weight:700}"
		+ ".icon-btn{width:36px;height:36px;border-radius:50%;background:#F3F4F6;display:flex;align-items:center;justify-content:center;color:#6B7280}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".list{display:block}"
		+ ".item{display:flex;align-items:center;background:#fff;border:1px solid #E5E7EB;border-radius:16px;padding:14px;margin-bottom:10px}"
		+ ".item.selected{border-color:#2563EB;background:#EFF6FF;box-shadow:0 0 0 1px #2563EB}"
		+ ".ico{width:40px;height:40px;border-radius:12px;flex-shrink:0;display:flex;align-items:center;justify-content:center;margin-right:14px}"
		+ ".mid{flex:1;min-width:0}"
		+ ".name{display:block;font-size:15px;font-weight:700;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
		+ ".sub{display:block;margin-top:2px;font-size:12px;color:#6B7280}"
		+ ".right{text-align:right;flex-shrink:0;margin-left:10px}"
		+ ".sum{display:block;font-size:14px;font-weight:700}"
		+ ".chev{display:block;margin-top:2px;font-size:18px;color:#C0C7D1}"
		+ ".check{display:block;margin-top:2px;font-size:16px;font-weight:700;color:#2563EB}"
		+ ".empty{padding:28px 8px;text-align:center;color:#6B7280;font-size:14px}";
	
КонецФункции

&НаСервере
Функция SVGИконкаСчета(ВидСчета)
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		Возврат "<svg width=""20"" height=""20"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M20 7H4a2 2 0 0 0-2 2v8a2 2 0 0 0 2 2h16a2 2 0 0 0 2-2V9a2 2 0 0 0-2-2z""/><path d=""M16 12h.01""/></svg>";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		Возврат "<svg width=""20"" height=""20"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M3 10l9-7 9 7""/><path d=""M5 10v10h14V10""/><path d=""M9 20v-6h6v6""/></svg>";
		
	КонецЕсли;
	
	Возврат "<svg width=""20"" height=""20"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><rect x=""2"" y=""5"" width=""20"" height=""14"" rx=""2""/><path d=""M2 10h20""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGСтрелкаНазад()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M15 18l-6-6 6-6""/></svg>";
	
КонецФункции

&НаСервере
Функция ЭкранироватьHTML(Знач Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(Знач АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Позиция = СтрНайти(НРег(СокрЛП(АдресСсылки)), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(СокрЛП(АдресСсылки), Позиция + 4);
	
КонецФункции

#КонецОбласти
